E-Lagori/Modules/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.PinNumbers=Pin Numbering

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length

###################################################################


eli_mcm_d_esp32.name=E-Lagori ESP32

eli_mcm_d_esp32.bootloader.tool=esptool_py
eli_mcm_d_esp32.bootloader.tool.default=esptool_py

eli_mcm_d_esp32.upload.tool=esptool_py
eli_mcm_d_esp32.upload.tool.default=esptool_py
eli_mcm_d_esp32.upload.tool.network=esp_ota

eli_mcm_d_esp32.upload.maximum_size=1310720
eli_mcm_d_esp32.upload.maximum_data_size=327680
eli_mcm_d_esp32.upload.flags=
eli_mcm_d_esp32.upload.extra_flags=

eli_mcm_d_esp32.serial.disableDTR=true
eli_mcm_d_esp32.serial.disableRTS=true

eli_mcm_d_esp32.build.tarch=xtensa
eli_mcm_d_esp32.build.bootloader_addr=0x1000
eli_mcm_d_esp32.build.target=esp32
eli_mcm_d_esp32.build.mcu=esp32
eli_mcm_d_esp32.build.core=esp32
eli_mcm_d_esp32.build.variant=ELi_McM_D_ESP32
eli_mcm_d_esp32.build.board=ELi_McM_D_ESP32

eli_mcm_d_esp32.build.f_cpu=240000000L
eli_mcm_d_esp32.build.flash_size=4MB
eli_mcm_d_esp32.build.flash_freq=40m
eli_mcm_d_esp32.build.flash_mode=dio
eli_mcm_d_esp32.build.boot=dio
eli_mcm_d_esp32.build.partitions=default
eli_mcm_d_esp32.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
eli_mcm_d_esp32.build.extra_libs=

eli_mcm_d_esp32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
eli_mcm_d_esp32.menu.PartitionScheme.default.build.partitions=default
eli_mcm_d_esp32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
eli_mcm_d_esp32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
eli_mcm_d_esp32.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
eli_mcm_d_esp32.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
eli_mcm_d_esp32.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
eli_mcm_d_esp32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
eli_mcm_d_esp32.menu.PartitionScheme.minimal.build.partitions=minimal
eli_mcm_d_esp32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
eli_mcm_d_esp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
eli_mcm_d_esp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
eli_mcm_d_esp32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
eli_mcm_d_esp32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
eli_mcm_d_esp32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
eli_mcm_d_esp32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
eli_mcm_d_esp32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
eli_mcm_d_esp32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
eli_mcm_d_esp32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
eli_mcm_d_esp32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
eli_mcm_d_esp32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
eli_mcm_d_esp32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
eli_mcm_d_esp32.menu.PartitionScheme.huge_app.build.partitions=huge_app
eli_mcm_d_esp32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
eli_mcm_d_esp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
eli_mcm_d_esp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
eli_mcm_d_esp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
eli_mcm_d_esp32.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
eli_mcm_d_esp32.menu.PartitionScheme.fatflash.build.partitions=ffat
eli_mcm_d_esp32.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
eli_mcm_d_esp32.menu.PartitionScheme.rainmaker=RainMaker
eli_mcm_d_esp32.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
eli_mcm_d_esp32.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

eli_mcm_d_esp32.menu.FlashMode.qio=QIO
eli_mcm_d_esp32.menu.FlashMode.qio.build.flash_mode=dio
eli_mcm_d_esp32.menu.FlashMode.qio.build.boot=qio
eli_mcm_d_esp32.menu.FlashMode.dio=DIO
eli_mcm_d_esp32.menu.FlashMode.dio.build.flash_mode=dio
eli_mcm_d_esp32.menu.FlashMode.dio.build.boot=dio
eli_mcm_d_esp32.menu.FlashMode.qout=QOUT
eli_mcm_d_esp32.menu.FlashMode.qout.build.flash_mode=dout
eli_mcm_d_esp32.menu.FlashMode.qout.build.boot=qout
eli_mcm_d_esp32.menu.FlashMode.dout=DOUT
eli_mcm_d_esp32.menu.FlashMode.dout.build.flash_mode=dout
eli_mcm_d_esp32.menu.FlashMode.dout.build.boot=dout

eli_mcm_d_esp32.menu.FlashFreq.80=80MHz
eli_mcm_d_esp32.menu.FlashFreq.80.build.flash_freq=80m
eli_mcm_d_esp32.menu.FlashFreq.40=40MHz
eli_mcm_d_esp32.menu.FlashFreq.40.build.flash_freq=40m

eli_mcm_d_esp32.menu.UploadSpeed.921600=921600
eli_mcm_d_esp32.menu.UploadSpeed.921600.upload.speed=921600
eli_mcm_d_esp32.menu.UploadSpeed.115200=115200
eli_mcm_d_esp32.menu.UploadSpeed.115200.upload.speed=115200
eli_mcm_d_esp32.menu.UploadSpeed.256000.windows=256000
eli_mcm_d_esp32.menu.UploadSpeed.256000.upload.speed=256000
eli_mcm_d_esp32.menu.UploadSpeed.230400.windows.upload.speed=256000
eli_mcm_d_esp32.menu.UploadSpeed.230400=230400
eli_mcm_d_esp32.menu.UploadSpeed.230400.upload.speed=230400
eli_mcm_d_esp32.menu.UploadSpeed.460800.linux=460800
eli_mcm_d_esp32.menu.UploadSpeed.460800.macosx=460800
eli_mcm_d_esp32.menu.UploadSpeed.460800.upload.speed=460800
eli_mcm_d_esp32.menu.UploadSpeed.512000.windows=512000
eli_mcm_d_esp32.menu.UploadSpeed.512000.upload.speed=512000

eli_mcm_d_esp32.menu.DebugLevel.none=None
eli_mcm_d_esp32.menu.DebugLevel.none.build.code_debug=0
eli_mcm_d_esp32.menu.DebugLevel.error=Error
eli_mcm_d_esp32.menu.DebugLevel.error.build.code_debug=1
eli_mcm_d_esp32.menu.DebugLevel.warn=Warn
eli_mcm_d_esp32.menu.DebugLevel.warn.build.code_debug=2
eli_mcm_d_esp32.menu.DebugLevel.info=Info
eli_mcm_d_esp32.menu.DebugLevel.info.build.code_debug=3
eli_mcm_d_esp32.menu.DebugLevel.debug=Debug
eli_mcm_d_esp32.menu.DebugLevel.debug.build.code_debug=4
eli_mcm_d_esp32.menu.DebugLevel.verbose=Verbose
eli_mcm_d_esp32.menu.DebugLevel.verbose.build.code_debug=5

eli_mcm_d_esp32.menu.EraseFlash.none=Disabled
eli_mcm_d_esp32.menu.EraseFlash.none.upload.erase_cmd=
eli_mcm_d_esp32.menu.EraseFlash.all=Enabled
eli_mcm_d_esp32.menu.EraseFlash.all.upload.erase_cmd=-e
